In [4]:
import pandas as pd

In [5]:
df_track = pd.read_csv("C:\\1espx\PythonFIAP\\2 Semestre\\Aula 2\\Csv\\Track_202408231944.csv")

In [6]:
df_track.groupby("Name")["Milliseconds"].sum()

Name
"40"                                                           157962
"?"                                                           2782333
"Eine Kleine Nachtmusik" Serenade In G, K. 525: I. Allegro     348971
#1 Zero                                                        299102
#9 Dream                                                       278312
                                                               ...
É que Nessa Encarnação Eu Nasci Manga                          196519
Étude 1, In C Major - Preludio (Presto) - Liszt                 51780
Óculos                                                         219271
Óia Eu Aqui De Novo                                            219454
Último Pau-De-Arara                                            200437
Name: Milliseconds, Length: 3257, dtype: int64

In [7]:
df_track["Milliseconds"]

0       343719
1       342562
2       230619
3       252051
4       375418
         ...
3498    286741
3499    139200
3500     66639
3501    221331
3502    206005
Name: Milliseconds, Length: 3503, dtype: int64

In [8]:
import numpy as np

In [9]:
vetor = np.array([10, 20, 30, 40, 50])

In [10]:
matriz_2d = np.array([[10, 20], [4, 5]])
matriz_2d

array([[10, 20],
       [ 4,  5]])

In [22]:
s1 = pd.Series([10, 20, 30, 40, 50], name = "Serie 1")
s2 = pd.Series([1, 2, 3, 4, 5], name = "Serie 2")
s3 = pd.Series(["A", "B", "C", "D", "E"], name = "Serie 3")

soma = s1 + s2
sub = s1 - s2
mult = s1 * s2
div = s1 / s2

In [33]:
print(s1)

0    10
1    20
2    30
3    40
4    50
Name: Serie 1, dtype: int64

In [18]:
df = pd.DataFrame({"Serie 1":s1,"Serie 2":s2})
df

   Serie 1  Serie 2
0       10        1
1       20        2
2       30        3
3       40        4
4       50        5

In [23]:
df["soma"] = df["Serie 1"] + df["Serie 2"]
df["sub"] = df["Serie 1"] - df["Serie 2"]
df["mult"] = df["Serie 1"] * df["Serie 2"]
df["div"] = df["Serie 1"] / df["Serie 2"]
df

   Serie 1  Serie 2  soma  sub  mult   div
0       10        1    11    9    10  10.0
1       20        2    22   18    40  10.0
2       30        3    33   27    90  10.0
3       40        4    44   36   160  10.0
4       50        5    55   45   250  10.0

In [26]:
df = pd.DataFrame({"Serie 1" : s1, "Serie 2": s2, "Serie 3": s3})
df["soma"] = df["Serie 1"] + df["Serie 2"]
df["sub"] = df["Serie 1"] - df["Serie 2"]
df

   Serie 1  Serie 2 Serie 3  soma  sub
0       10        1       A    11    9
1       20        2       B    22   18
2       30        3       C    33   27
3       40        4       D    44   36
4       50        5       E    55   45

In [27]:
df.groupby("Serie 3")["soma"].max()
df.groupby("Serie 3")["soma"].min()
df.groupby("Serie 3")["soma"].mean()
df.groupby("Serie 3")["soma"].median()
df.groupby("Serie 3")["soma"].std()

Serie 3
A   NaN
B   NaN
C   NaN
D   NaN
E   NaN
Name: soma, dtype: float64